Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD09_DFP/2.4.129/svd/ATSAMD09D14A.svd
            <register>
               <dim>1</dim>
               <dimIncrement>4</dimIncrement>
               <name>CONFIG[%s]</name>
               <description>Configuration n</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SENSE0</name>
                     <description>Input Sense 0 Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE0Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising-edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling-edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both-edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High-level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low-level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN0</name>
                     <description>Filter 0 Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SENSE1</name>
                     <description>Input Sense 1 Configuration</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE1Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN1</name>
                     <description>Filter 1 Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SENSE2</name>
                     <description>Input Sense 2 Configuration</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE2Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN2</name>
                     <description>Filter 2 Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SENSE3</name>
                     <description>Input Sense 3 Configuration</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE3Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN3</name>
                     <description>Filter 3 Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SENSE4</name>
                     <description>Input Sense 4 Configuration</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE4Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN4</name>
                     <description>Filter 4 Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SENSE5</name>
                     <description>Input Sense 5 Configuration</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE5Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN5</name>
                     <description>Filter 5 Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SENSE6</name>
                     <description>Input Sense 6 Configuration</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE6Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN6</name>
                     <description>Filter 6 Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SENSE7</name>
                     <description>Input Sense 7 Configuration</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SENSE7Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTEN7</name>
                     <description>Filter 7 Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
