Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD09_DFP/2.4.129/svd/ATSAMD09D14A.svd
               <register>
                  <name>MASK</name>
                  <description>MODE2_ALARM Alarm n Mask</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SEL</name>
                        <description>Alarm Mask Selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>SELSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>Alarm Disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SS</name>
                              <description>Match seconds only</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MMSS</name>
                              <description>Match seconds and minutes only</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HHMMSS</name>
                              <description>Match seconds, minutes, and hours only</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DDHHMMSS</name>
                              <description>Match seconds, minutes, hours, and days only</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MMDDHHMMSS</name>
                              <description>Match seconds, minutes, hours, days, and months only</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>YYMMDDHHMMSS</name>
                              <description>Match seconds, minutes, hours, days, months, and years</description>
                              <value>0x6</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral>
         <name>SERCOM0</name>
         <version>U22012.0.0</version>
         <description>Serial Communication Interface</description>
         <groupName>SERCOM</groupName>
         <prependToName>SERCOM_</prependToName>
         <baseAddress>0x42000800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x31</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SERCOM0</name>
            <value>9</value>
         </interrupt>
         <registers>
            <cluster>
               <name>I2CM</name>
               <description>I2C Master Mode</description>
               <headerStructName>SercomI2cm</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>I2CM Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>USART_EXT_CLK</name>
                              <description>USART with external clock</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART_INT_CLK</name>
                              <description>USART with internal clock</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_SLAVE</name>
                              <description>SPI in slave operation</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_MASTER</name>
                              <description>SPI in master operation</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_SLAVE</name>
                              <description>I2C slave operation</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_MASTER</name>
                              <description>I2C master operation</description>
                              <value>0x5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run in Standby</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PINOUT</name>
                        <description>Pin Usage</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SDAHOLD</name>
                        <description>SDA Hold Time</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SDAHOLDSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>75NS</name>
                              <description>50-100ns hold time</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>450NS</name>
                              <description>300-600ns hold time</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>600NS</name>
                              <description>400-800ns hold time</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MEXTTOEN</name>
                        <description>Master SCL Low Extend Timeout</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SEXTTOEN</name>
                        <description>Slave SCL Low Extend Timeout</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SPEED</name>
                        <description>Transfer Speed</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SPEEDSelect</name>
                           <enumeratedValue>
                              <name>STANDARD_AND_FAST_MODE</name>
                              <description>Standard Mode(Sm) Upto 100kHz and Fast Mode(Fm) Upto 400kHz </description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FASTPLUS_MODE</name>
                              <description>Fast-mode Plus Upto 1MHz</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HIGH_SPEED_MODE</name>
                              <description>High-speed mode Upto 3.4MHz</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SCLSM</name>
                        <description>SCL Clock Stretch Mode</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INACTOUT</name>
                        <description>Inactive Time-Out</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>INACTOUTSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>55US</name>
                              <description>5-6 SCL Time-Out(50-60us)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>105US</name>
                              <description>10-11 SCL Time-Out(100-110us)</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>205US</name>
                              <description>20-21 SCL Time-Out(200-210us)</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LOWTOUTEN</name>
                        <description>SCL Low Timeout Enable</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>I2CM Control B</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SMEN</name>
                        <description>Smart Mode Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>QCEN</name>
                        <description>Quick Command Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CMD</name>
                        <description>Command</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>ACKACT</name>
                        <description>Acknowledge Action</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD</name>
                  <description>I2CM Baud Rate</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>BAUDLOW</name>
                        <description>Baud Rate Value Low</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>HSBAUD</name>
                        <description>High Speed Baud Rate Value</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>HSBAUDLOW</name>
                        <description>High Speed Baud Rate Value Low</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>I2CM Interrupt Enable Clear</description>
                  <addressOffset>0x14</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>MB</name>
                        <description>Master On Bus Interrupt Disable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SB</name>
                        <description>Slave On Bus Interrupt Disable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt Disable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>I2CM Interrupt Enable Set</description>
                  <addressOffset>0x16</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>MB</name>
                        <description>Master On Bus Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SB</name>
                        <description>Slave On Bus Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>I2CM Interrupt Flag Status and Clear</description>
                  <addressOffset>0x18</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>MB</name>
                        <description>Master On Bus Interrupt</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SB</name>
                        <description>Slave On Bus Interrupt</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>I2CM Status</description>
                  <addressOffset>0x1A</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BUSERR</name>
                        <description>Bus Error</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ARBLOST</name>
                        <description>Arbitration Lost</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXNACK</name>
                        <description>Received Not Acknowledge</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUSSTATE</name>
                        <description>Bus State</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LOWTOUT</name>
                        <description>SCL Low Timeout</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLKHOLD</name>
                        <description>Clock Hold</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MEXTTOUT</name>
                        <description>Master SCL Low Extend Timeout</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SEXTTOUT</name>
                        <description>Slave SCL Low Extend Timeout</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LENERR</name>
                        <description>Length Error</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>I2CM Synchronization Busy</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>SERCOM Enable Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SYSOP</name>
                        <description>System Operation Synchronization Busy</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
